{
    "_meta": {
        "sources": [
            {
                "json": "FA:BN",
                "abbreviation": "FA:BN",
                "full": "ForbiddenArcana: Barovian Nightmare",
                "authors": [
                    "ForbiddenArcana"
                ],
                "convertedBy": [
                    "ForbiddenArcana"
                ],
                "version": "1.0",
                "targetSchema": "1.2.0",
                "color": "561d5e"
            }
        ]
    },
    "boon": [
        {
            "name": "Lost Spell Boon",
            "source": "FA:BN",
            "entries": [
                "Your casting of the Lost Spell has permanently altered your connection to the Weave, empowering it. You gain the following permanent benefits:",
                {
                    "type": "list",
                    "items": [
                        "You count as one full caster level higher for the purposes of spell slots. Ie, a 12th level full caster would now have 7th level spell slots but may not prepare 7th level spells.",
                        "You learn one cantrip of your choice from any spell list.",
                        "You may prepare an additional two spells (if you are a Spells prepared caster) or learn an additional two spells (if you are a Spells Known caster, or do not have the Spellcasting feature). You do not gain this benefit multiple time if you have multiple class levels which grant the Spellcasting feature.",
                        "Choose one 1st level spell from any spell list. You may cast it once per long rest without expending a spell slot."
                    ]
                },
                "You use your spellcasting stat for these spells. If you do not have a spellcasting stat, you may choose one of Intelligence, Wisdom, or Charisma.",
                "This feature can only be acquired by casting {@spell The Lost Spell|FA:BN}."
            ]
        },
        {
            "name": "Empowered Holy Symbol of Ravenkind",
            "source": "FA:BN",
            "entries": [
                "Empowered by the consecration of the Mountain Fane, the Weaver has granted the Holy Symbol of Ravenkind the following changes:",
                {
                    "type": "list",
                    "items": [
                        "The maximum number of charges the Symbol can have is increased to 12, from 10. The Holy Symbol instead regains {@dice 1d6+6} charges each dawn, instead of {@dice 1d6+4}.",
                        {
                            "type": "entries",
                            "name": "Shield of the Night",
                            "entries": [
                                "As an action, you can expend 4 charges and cast {@spell Bulwark of Protection|FA} without material components."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Greater Empowered Holy Symbol of Ravenkind",
            "source": "FA:BN",
            "entries": [
                "Empowered by the consecration of the Swamp Fane, the Seeker has granted the Holy Symbol of Ravenkind the following changes:",
                {
                    "type": "list",
                    "items": [
                        {
                            "type": "entries",
                            "name": "Eyes of the Night",
                            "entries": [
                                "You can expend 9 charges and cast {@spell Scrying} using the Holy Symbol as the material component."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Bond of the Faithful",
                            "entries": [
                                "The Holy Symbol of Ravenkind no longer requires attunement when wielded by the devout follower of the Rozana. No other creature may gain this benefit."
                            ]
                        }
                    ]
                }
            ]
        }
    ],
    "spell": [
        {
            "name": "The Lost Spell",
            "source": "FA:BN",
            "level": 0,
            "school": "N",
            "time": [
                {
                    "number": 1,
                    "unit": "minute"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "self"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "Ink with which to write the fragments on your hand"
            },
            "duration": [
                {
                    "type": "instant"
                }
            ],
            "meta": {
                "ritual": true
            },
            "entries": [
                "Inscribe the 16 spell fragments upon your off hand with ink. Speak the incantation, and then name any person, living, dead, or undead, except for yourself. The spell will then take effect on the target. When the target dies at any point in time in the future (or immediately, if the target is already dead), the following effects will take place:",
                {
                    "type": "list",
                    "items": [
                        "The target will be resurrected, as by the effect of a {@spell True Resurrection} spell.",
                        "All curses, diseases, levels of exhaustion, madnesses, or any other negative effects on the target are immediately removed, as though effected by as many castings of {@spell Greater Restoration} as needed.",
                        "All lingering injuries, missing limbs, or other bodily injuries are immediately healed, as though by the effect of Regenerate. If the target has no body (if they were Disintegrated or their body was destroyed by some other method), the spell creates a new body for the target.",
                        "Any bindings, chains, restrains, cages, or other trammels are gone, giving the target free range of motion.",
                        "The target will be teleported to a place of safety (if their current locale is unsafe or hostile), as by the effect of {@spell Teleport}. The location they are teleported to does not require a permanent teleportation circle or associated object. The spell is aware when an area is considered \"unsafe\" for a target, and thus the target will not be brought back at the bottom of the ocean, for example. Alternatively, the target may instead choose where they wish to be teleported, or if they wish to be teleported at all. This {@spell Teleport} will always be On Target.",
                        "The target will be granted a minute of time, as though they had cast the spell {@spell Time Stop} with a duration of 10 rounds as opposed to a duration of 1d4+1 rounds."
                    ]
                },
                "A creature may be targetted by The Lost Spell multiple times, but may only cast it once.",
                "There is no time limit for how long a target may be dead for. The spell always works. If the target is a sentient undead (such as a lich, or a vampire), the spell will take effect the next time they are killed, at which point the spell will return them to life as a non-undead.",
                "You do not need to be a spellcaster to cast The Lost Spell.",
                "INCANTATION: \"For in the time of greatest need, may I give the greatest gift. From life to life, end to end, may a second chance be granted to ${Target Name}. May they be free, may they be healed, may they be whole. I ask for naught, but to give them the gift of life.\"",
                "Note: This spell is listed as a cantrip only for the purposes of Foundry. It does not have a level, and can't be replicated by Wish or some other magic or item which allows you to cast spells not normally on your spell list.",
                "After casting this spell, the caster gains the benefit of {@boon Lost Spell Boon|FA:BN}."
            ],
            "miscTags": [
                "TP"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Artificer",
                        "source": "TCE"
                    },
                    {
                        "name": "Barbarian",
                        "source": "PHB"
                    },
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Cleric",
                        "source": "PHB"
                    },
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Fighter",
                        "source": "PHB"
                    },
                    {
                        "name": "Monk",
                        "source": "PHB"
                    },
                    {
                        "name": "Paladin",
                        "source": "PHB"
                    },
                    {
                        "name": "Ranger",
                        "source": "PHB"
                    },
                    {
                        "name": "Rogue",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            },
            "fluff": {
                "entries": [
                    "The Lost Spell is an ancient, mythical spell said to be created by Mystra herself. The 16 fragments composing the spell have been seperated and scattered across time and space. Countless lives have been spent and lost chasing rumours of a single fragment, for they are said to appear anywhere in any tome in the world.",
                    "Collecting the fragments from the many scattered texts, scrolls, and etchings where they manifest is an impossible task. Unless, of course, you have access to a lost temple with an infinite library containing every book ever written, hidden away from all threats which may distract you from your search..."
                ]
            }
        },
        {
            "name": "Enhance Potion",
            "source": "FA:BN",
            "level": 1,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "minute"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "self"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "alchemist supplies"
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "amount": 24,
                        "type": "hour"
                    }
                }
            ],
            "entries": [
                "Using your Alchemist's Supplies, you can enhance a potion. You touch a potion or an Experimental Elixir and choose one of the following effects:",
                {
                    "type": "list",
                    "items": [
                        {
                            "entries": [
                                "If the potion has a duration, you may double the duration of the potion, up to a maximum of one additional hour. When you cast this spell using a spell slot of 2nd level or higher and choose this option, the maximum additional time increases by one hour for each slot level above 1st."
                            ]
                        },
                        {
                            "entries": [
                                "If the potion deals damage or heals, you roll one additional die to determine the healing or damage done. When you cast this spell using a spell slot of 2nd level or higher, you roll an additional die to determine the healing or damage done for each slot level above 1st."
                            ]
                        }
                    ]
                },
                "These effects last for the spell's duration, or until you cast this spell again on the same potion."
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Artificer",
                        "source": "TCE"
                    }
                ]
            }
        },
        {
            "name": "Poisoned Weapon",
            "source": "FA:BN",
            "level": 1,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "bonus"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "self"
                }
            },
            "components": {
                "s": true,
                "m": "a poisoner's kit or alchemist supplies"
            },
            "duration": [
                {
                    "type": "timed",
                    "concentration": true,
                    "duration": {
                        "amount": 1,
                        "type": "minute",
                        "upTo": true
                    }
                }
            ],
            "entries": [
                "As a bonus action, you touch a weapon and coat it with a poisonous substance. The next time that weapon deals damage during the spell's duration, it deals an additional {@damage 2d6} poison damage. Additionally, if the target is a creature it must make a Constitution saving throw or become {@condition poisoned} for the duration of the spell. A creature may repeat the saving throw at the end of its turn, ending the effect on a success."
            ],
            "damageInflict": [
                "poison"
            ],
            "conditionInflict": [
                "poisoned"
            ],
            "savingThrow": [
                "constitution"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Artificer",
                        "source": "TCE"
                    }
                ]
            }
        }
    ],
    "baseitem": [
        {
            "name": "Moonshot",
            "source": "FA:BN",
            "type": "R",
            "rarity": "rare",
            "weight": 2,
            "weaponCategory": "martial",
            "property": [
                "A",
                "H",
                "2H"
            ],
            "range": "150/600",
            "dmg1": "1d8",
            "dmgType": "P",
            "bow": true,
            "weapon": true,
            "ammoType": "arrow|phb",
            "entries": [
                "Every arrow fired by the Moonshot glows ever so slightly as it is loosed, glistening in light that may not be there.",
                {
                    "type": "entries",
                    "name": "Illuminor",
                    "entries": [
                        "Moonshot has 3 charges. You may choose to expend a charge, granting your next attack an additional {@damage 1d8} to hit, and it deals an additional {@damage 1d8} radiant damage to the target. In addition, the target leaves a magical trail of moonlight behind them for one hour. A creature with Truesight or Detect Magic active can see this trail of moonlight. The trail fades after 1 hour, or the target dies.",
                        "Moonshot regains 1 charge for every hour it is left outside at night."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Starry Eyed",
                    "entries": [
                        "Your eyes glitter with the pale glow of the full moon, granting you 10ft of Truesight."
                    ]
                }
            ],
            "srd": true,
            "basicRules": true,
            "tier": "major",
            "bonusWeapon": "+1",
            "fluff": {
                "entries": [
                    "\"The moon shall light your path.\"",
                    "- Marak, High Priestess of the Rozana"
                ]
            }
        },
        {
            "name": "Singularity Pearl",
            "source": "FA:BN",
            "srd": true,
            "tier": "major",
            "rarity": "rare",
            "reqAttune": true,
            "wondrous": true,
            "entries": [
                "This unearthly pearl seems to be both heavy as a cannonball and light as a feather in your hand as the light bends around it. This pearl must be attached to a weapon in order to be used. If the weapon is not magical, its damage becomes magical. If the weapon does not require attunement, it now does.",
                "Attaching the pearl to the weapon requires pressing it against the weapon for at least 10 minutes. Thereafter, the pearl can't be removed unless you detatch it as an action, or the weapon is destroyed. Not even an antimagic field causes it to fall off. The pearl falls off the weapon if your attunement to the weapon ends.",
                "The pearl has 3 charges and regains all charges at the end of a Long Rest. While the pearl is attached to a weapon you are attuned to, you may expend a charge to perform one of the following effects:",
                {
                    "type": "list",
                    "items": [
                        "Meteor Strike: You manipulate gravity to launch yourself into the air and slam into the ground with a concussive blast. As an action, you may jump up to 30 feet. Any creature within 10 feet of where you land must make a Dexterity Saving Throw or take {@damage 2d6} bludgeoning damage and be knocked prone plus an additional {@damage 1d6} bludgeoning damage for every 10 ft you jumped. On a succesful save they tale half damage and are not knocked prone. This damage can not exceed {@damage 8d6} total. You do not take falling damage performing Meteor Strike.",
                        "Superluminal Projectile: The weapon becomes as light as a feather up until the instant of impact. If the weapon has the thrown property, you can use an action to throw the weapon in a line up to 120 ft long and 5 ft wide. All creatures along the weapon's path must make a Dexterity saving throw, or take damage equal to an Critical Hit from the weapon, or half on a success. The weapon lands at the end of its travel distance, and must be recovered.",
                        "Event Horizon: As a bonus action, you may manipulate the weapon's weight at choice moments in the strike, increasing the momentum to deal deadly blows. Until the end of your turn, the weapon does an additional {@damage 1d4} damage and any creature hit by an attack must make a Strength Saving Throw or be pushed back 5 ft."
                    ]
                },
                "The DC for the Saving Throws is equal to 8 + your proficiency bonus + your Strength modifier."
            ],
            "fluff": {
                "entries": [
                    "\"Behold, the weight of the world in your hands.\"",
                    " - Father Consilimagno of Candlekeep"
                ]
            }
        },
        {
            "name": "Ring of Healthy Growth",
            "source": "FA:BN",
            "type": "RG",
            "rarity": "very rare",
            "reqAttune": true,
            "entries": [
                "This brass ring is inset with numerous green emeralds which seem to be watching you. While wearing the ring, you gain the following benefits:",
                {
                    "type": "entries",
                    "name": "Growing Strength",
                    "entries": [
                        "This ring has 3 charges. As an action, you may expend a charge and cast {@spell heroism} at 1st level. When cast in this way, the spell does not require concentration. The ring recharges {@dice 1d3} charges after being buried in fertile earth (such as a garden, or an area affected by the {@spell plant growth} spell) for 4 hours."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Overgrowth",
                    "entries": [
                        "Your Consititution score increases by 1."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Rampant Growth",
                    "entries": [
                        "As a reaction before you take damage, you may cause the emeralds in the ring to explode into vines that encircle you and take as much of the triggering damage as possible. The vines grant you total cover, and make the ground within 5 feet of you difficult terrain. The vines have AC 10 + your proficiency bonus, HP 10 x your level, automatically fails saving throws, has vulnerability to fire damage and immunity to psychic damage. Any spell that would target you instead targets the vines. The vines last until they are destroyed, or you dismiss them (no action required). When you use this property, you can't use it again until the ring has regained at least one charge."
                    ]
                }
            ],
            "fluff": {
                "entries": [
                    "\"No man is an island entire of itself.\"",
                    " - John Donne"
                ]
            }
        },
        {
            "name": "Fulgurite",
            "source": "FA:BN",
            "srd": true,
            "type": "M",
            "rarity": "rare",
            "reqAttune": false,
            "weight": 4,
            "weaponCategory": "simple",
            "property": [
                "V"
            ],
            "dmg1": "1d6",
            "dmgType": "P",
            "dmg2": "1d8",
            "bonusWeapon": "+1",
            "charges": 5,
            "recharge": "dawn",
            "baseItem": "spear|phb",
            "entries": [
                "The Fulgurite has 5 charges.",
                "As an action, you may expend 3 charges to cast {@spell lightning bolt} (Spell Save DC 15) from the spear.",
                "When you hit a creature with this spear, you may expend any number of charges to deal an additional {@damage 1d8} lightning damage to the creature. If you expend more than 1 charge using this feature, you can either increase the lightning damage by {@damage 1d8} per charge expended, or have the lightning arc to additional creatures. If you choose to have it arc to additional creatures, make an attack roll against a different creature within 10ft of a creature who has taken lightning damage from this spear, with advantage if they are wearing metal. On a hit, they take {@damage 1d8} lightning damage.",
                "Fulgurite regains {@dice 1+1d4} charges every long rest, and regains an additional charge for every 10 points of lighting damage the wielder takes in a single instance."
            ],
            "fluff": {
                "entries": [
                    "\"Piezoelectric impact absorbers in the haft should be sufficient to offset any inefficiencies in the thermal chargers. This newest prototype should no longer explode unprompted.\"",
                    " - Design notes for iteration 0.3.0"
                ]
            }
        },
        {
            "name": "Nightliner",
            "source": "FA:BN",
            "basicRules": true,
            "tier": "minor",
            "rarity": "uncommon",
            "wondrous": true,
            "entries": [
                "The fabled Nightliner. It's like Charcoal No. 5, but for eyes. Perfect for edgy teens, edgy adults, or someone who wants to capture the \"hasn't had a full night's sleep in years,\" look.",
                {
                    "type": "entries",
                    "name": "Enchanted Eyes",
                    "entries": [
                        "It takes one minute to apply this eyeliner, when it is applied around the eyes you gain Darkvision up to 60ft. Additionally you gain a +5 bonus to any sight based Perception checks. These features last for 12 hours or until the eyeliner is removed or smeared (by rain, mud, swimming, tears, etc). This eyeliner is not waterproof. You can use this make-up 20 times before it completely runs out."
                    ]
                }
            ]
        },        
        {
            "name": "Martyr's Tread",
            "source": "FA:BN",
            "tier": "major",
            "rarity": "rare",
            "reqAttune": true,
            "wondrous": true,
            "bonusAc": "+1",
            "entries": [
                "\"A hundred miles and not one further.\"",
                "These metal greaves and dented and scarred, but the quality of the craftsmanship is obvious despite the age. While you wear these boots, you gain the following benefit:",
                {
                    "type": "list",
                    "items": [
                        "You gain a bonus of +1 to your AC.",
                        "When your current hitpoints (including temporary hitpoints) are below a quarter of your hitpoint maximum, you or allies who start their turn within 10 feet of you while you are conscious may add 2 to the damage rolls of any melee or spell attacks they make during their turn.",
                        "When your current hitpoints (including temporary hitpoints) are below a tenth of your hitpoint maximum and you are still conscious, the damage increases to 2 + your Constitution modifier."
                    ]
                }
            ],
            "fluff": {
                "entries": [
                    "When the dead came the first time, Vaonur Berevan was a coward. He ran for the stables, ground upending as what was below came above. There was a single horse, and one other survivor. Savika never was good with horses. Today was no exception. Her screams echoed over the beat of the hooves.",
                    "He clutched the wooden hands dangling from his neck on a red cord but heard no answer.",
                    "Through the forests and the fields Vaonur fled.",
                    "When the dead came the second time, Vaonur Berevan was a coward. He ran for the docks, teeth gnashing at his heels as the ground was torn asunder by their twisted claws. The cold water slowed his pace, but it slowed Karmen more. His screams carried over the winds and waves.",
                    "He clutched the wooden hands dangling from his neck on a red cord but heard no answer.",
                    "Across the lakes and rivers Vaonur fled.",
                    "When the dead came for the third time, Vaonur clutched the wooden hands dangling from his neck on a red cord and heard an answer.",
                    "IS SURVIVAL VICTORY WHEN ALL YOU LOVE ENDS",
                    "When the dead came for the third time, Vaonur was no coward. After a hunred miles he ran not one further."
                ]
            }
        },
        {
            "name": "Mantle of the Raven",
            "source": "FA:BN",
            "srd": true,
            "tier": "major",
            "rarity": "rare",
            "charges": 3,
            "recharge": "dusk",
            "reqAttune": true,
            "wondrous": true,
            "entries": [
                "This cloak of raven feathers seems to drink in the light and move in a breeze that is not there. Out of the corner of your eye, you can't help but feel like you can see through this shadowy cloak.",
                "The cloak has 3 charges. While wearing the cloak, you can use a bonus action to expend 1 charge to change into a trio of Ravens, as though by a Druid's Wild Shape feature. Each Raven moves independently and acts on your initiative.",
                "At the end of your turn, you choose one surviving Raven and reappear in that location in your original body. Alternatively, you can expend an additional charge (no action required) to maintain the raven form until the end of your next turn.",
                "If all Ravens are killed, you reappear in the position of the last surviving Raven with any excess damage dealt to the last Raven carrying over to you. If all the surviving Ravens are killed simultaneously, you randomly choose which Raven's space you reappear in.",
                "While in Raven form you can still take Actions, however, if the Ravens choose to act they must use the same Action. (Ie, if you take the dash action in Raven form, all Ravens may take the dash action if they wish. However, they can only take the dash action that turn.)",
                "The cloak regains {@dice 1d3} charges every midnight."
            ]
        },
        {
            "name": "Holy Symbol of Ravenkind",
            "source": "FA:BN",
            "srd": true,
            "tier": "major",
            "rarity": "legendary",
            "charges": 10,
            "recharge": "dawn",
            "reqAttune": true,
            "wondrous": true,
            "entries": [
                "The Holy Symbol of Ravenkind is a unique holy symbol sacred to the good-hearted faithful of Barovia. It predates the establishment of any church in Barovia. According to legend, it was delivered to a faithful follower of the Seeker, who directed them to find someone worthy to carry the symbol. Many forest folk and other faithful attempted to wield the Symbol, but all failed.",
                "The holy symbol is a platinum amulet, with a large crystal embedded in its center. Around the ruby are three stylized ravens in a triquetra shape.",
                "In order to attune to the Holy Symbol of Ravenkind, one must pledge themselves to be a devout follower of the Rozana. When a creature attempts to attune the symbol, one of the Seeker, Weaver, or Huntress will appear in the mind of the creature to judge their worthiness.",
                "The Holy Symbol has 10 charges and regains {@dice 1d6+4} charges at dawn.",
                "While attuned, a creature has the following benefits:",
                {
                    "type": "entries",
                    "name": "Shroud of the Seeker",
                    "entries": [
                        "Anyone who wears the Symbol of Ravenkind gains the benefits of a Nondetection spell and is immune to psychic damage. As an action, the wearer can expend 2 charges to project this effect in a 15 ft radius around themselves, protecting any other creature within range. This effect lasts one hour or until you end it (no actionr equired)."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Spirits of the Weaver",
                    "entries": [
                        "As an action, you can expend 3 charges to magically summon {@dice 1d4+1} swarms of ravens or {@dice 2d4} wolves or {@dice 1d2} dire wolves to aid you in combat. After 10 minutes, or until you use this feature again, the beasts dissolve into mist and disappear."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Respite of Mother Night",
                    "entries": [
                        "As an action, you can expend 5 charges while presenting the holy symbol to make it shed bright light in a 30-foot radius and dim light for an additional 30 feet. The light is sunlight and lasts for 10 minutes or until you end the effect (no action required)."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Mercy of the Huntress",
                    "entries": [
                        "You can expend 10 charges while presenting the Holy Symbol to cast {@spell raise dead} without Material components."
                    ]
                },
                "The Rozana of Barovia are weakened after centuries of being trapped in a Demiplane. After purifying one Fane, the Holy Symbol gains the benefits of {@boon Empowered Holy Symbol of Ravenkind|FA:BN}. After purifying two Fanes, the Holy Symbol gains the benefits of {@boon Greater Empowered Holy Symbol of Ravenkind|FA:BN}."
            ]
        },
        {
            "name": "Ring of Encode Thoughts",
            "source": "FA:BN",
            "type": "RG",
            "rarity": "uncommon",
            "reqAttune": true,
            "entries": [
                "These simple black rings are engraved around the inside with esoteric symbols and runes and are typically made in sets of under 10. While attuned to a Ring of Encode Thoughts, you can cast the cantrip {@spell Encode Thoughts|GGR} as an action, even if you do not know it.",
                "When you cast Encode Thoughts via the Ring, you may instead store the thought within the Ring as opposed to encoding it in a Thought Strand. Thoughts stored within the Ring stay in it perpetually, and are not lost when you cast Encode Thoughts again. The Ring has no maximum limit to the number of thoughts it can store. Alternatively, as an action, you can cast Encode Thoughts and remove a thought from the Ring whereupon it will behave as a normal Thought Strand. Unless the thought is returned to the ring, it will be lost and destroyed when the duration of Encode Thoughts expires.",
                "Each Ring of Encode Thoughts is magically linked to the other Rings of Encode Thoughts that were made as part of the same set. A creature attuned to a Ring of Encode Thoughts can access the thoughts encoded in the linked Rings of Encode Thoughts, and is capable of removing or adding memories to the other rings. A creature attuned to a Ring of Encode Thoughts can detect when someone else attunes to a linked Ring of Encode Thoughts, and can sense when a new thought is added to or removed from one of the linked Rings.",
                "A creature attuned to the Ring can sense the general idea or feeling associated with each thought stored in the Ring and its linked companions, allowing them to search through the database of the linked Rings. However, one must use an action to cast Encode Thoughts and receive the specific details of the thought."
            ],
            "fluff": {
                "entries": [
                    "\"There is no such thing as the cloud, it's just somebody else's warforged.\"",
                    " - Rdb \"Relational DataBase\" Dagvin"
                ]
            }
        },
        {
            "name": "Fragment of the Emerald Tablet",
            "source": "FA:BN",
            "tier": "major",
            "rarity": "artifact",
            "reqAttune": true,
            "wondrous": true,
            "entries": [
                "A fragment of the ancient and famous Emerald Tablet, this repository of alchemical lore is full of hidden secrets and lost lore. Sought after by archmages, alchemists, and explorers for centuries, even this small fragment possesses invaluable knowledge.",
                "Attuning to the Fragment of the Emerald Tablet is a painful and time consuming process, requiring the creature to spend 80 hours over the course of 5 days studying the Tablet. At the end of every day, the creature must make a DC 15 Constitution Saving Throw, or suffer a level of exhaustion as the ancient magics of the Tablet lash against your mind.",
                "While attuned to The Fragment of the Emerald Tablet, a creature gains the following effects:",
                {
                    "type": "list",
                    "items": [
                        "Your Intelligence score is increased by 1, and the maximum of the score is also increased by 1.",
                        "Your Strength score is reduced by 1.",
                        "Any plant that isn't a creature takes {@damage 1d6} necrotic damage when you touch it.",
                        "You can use an action to cast {@spell Sunbeam} without expending a spell slot. After you cast this spell, roll a {@dice 1d6}. On a roll of 1-5, you can't use this property until you complete a long rest. Intelligence is your spellcasting ability when you cast {@spell Sunbeam} using the Emerald Tablet.",
                        "While attuned, you may attempt to create a Flesh Golem. The process for creating a Flesh Golem takes 5 days of uninterupted work (resting no more than 10 hours a day), and requires at least two medium Humanoid corpses which will be destroyed and used as parts for the Golem as well as 100 GP of alchemical compounds. At the end of the procedure, you take {@damage 4d6} necrotic damage, and your maximum HP is reduced by the same amount. This reduction lasts until you finish a Long Rest.",
                        "While attuned, you may attempt to make one of the following potions over the course of a Long Rest if you have the associated value of alchemical compounds: Potion of Greater Healing (5 gp), Potion of Resistance (5 gp), Potion of Hydra Regeneration (10 gp), Wolfsbane Potion (10 gp), or Potion of Hill Giant Strength (20 gp)."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Curse",
                    "entries": [
                        "The Fragment of the Emerald Tablet is cursed. While attuned to it, a creature becomes jealously protective of the tablet, and feels a strong compulsion to seek out new knowledge. In addition, when they take a long rest they can only regain a quarter of their hit dice, and all healing from rolling hit dice is halved. Casting {@spell Remove Curse} has a 20% chance of succesfully breaking attunement. On a failure, the creature who cast {@spell Remove Curse} takes {@damage 4d6} necrotic damage. This necrotic damage can't be reduced."
                    ]
                }
            ]
        },
        {
            "name": "Shadowdale Six Pin",
            "source": "FA:BN",
            "basicRules": true,
            "tier": "minor",
            "rarity": "common",
            "wondrous": false,
            "entries": [
                "Found on a halfling sized skeleton wearing broken chitin armor near the Mountain Fane, this small golden pin is made of six interlocking golden rings. A creature holding it can use it to cast {@spell druidcraft} as an action."
            ],
            "fluff": {
                "entries": [
                    "A DC 12 History Check can identify the pin as being the symbol of the Shadowfale Six, a group of six heroes who came together to defend the village of Shadowdale from the Orc Family of the Axe who sought to kill the famous archmage Elminster (unaware of the fact that Elminster was not at Shadowdale at the time). The Shadowdale Six did not know each other beforehand; five of them were merely semi-accomplished adventurers who went to Shadowdale in hopes of meeting Elminster, while the sixth was the heir of the Family of the Axe who was usurped and cast out after attempting to stop the attack on Shadowdale. Together the Six defended Shadowdale for three days and three nights until the attack faltered.",
                    "If a character rolls over 15 on the History check they can also recall the members of the Shadowdale Six:",
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "entries",
                                "name": "2 Prophet Devalan",
                                "entries": [
                                    "A orc priest and heir to the Family of the Axe. He died many years later of old age."
                                ]
                            },
                            {
                                "type": "entries",
                                "name": "Cheery Wanderwood",
                                "entries": [
                                    "A well regarded halfling druid, known for her selflessness and determination. She disappeared a decade after Shadowdale, and no one ever heard from her again."
                                ]
                            },
                            {
                                "type": "entries",
                                "name": "Gavlax Shavvenzar",
                                "entries": [
                                    "Gavlax was a charismatic dragonborn sorcerer who longed to spread joy and the love of magic to everyone. He was kidnapped and (presumably) killed by Thayans assassins looking to impress a Zulkir a few years after Shadowdale."
                                ]
                            },
                            {
                                "type": "entries",
                                "name": "Mariam Solva",
                                "entries": [
                                    "A human ranger, she joined the Emerald Enclave near Cormyr after Shadowdale and swiftly rose to a respected leadership position. However the years and many injuries accumulated after a lifetime of adventuring means she is no longer the fighter she once was."
                                ]
                            },
                            {
                                "type": "entries",
                                "name": "Torvald Earthbreaker",
                                "entries": [
                                    "A Dwarven Fighter, he returned to Gauntlygrym and was later killed attempting to rescue innocent lives during the Neverwinter Cataclysm."
                                ]
                            },
                            {
                                "type": "entries",
                                "name": "Essendaria Lyllwynden",
                                "entries": [
                                    "An Elven Swashbuckler, she returned to Waterdeep flush with riches and fame. Following the deaths or disappearences of her former comrades, she has become sullen and withdrawn, drinking away the rest of her centuries of life in taverns across Waterdeep and lamenting what was lost."
                                ]
                            }
                        ]
                    }
                ]
            }
        },
        {
            "name": "Spellwoven Robes",
            "source": "FA:BN",
            "basicRules": true,
            "tier": "minor",
            "rarity": "uncommon",
            "wondrous": true,
            "entries": [
                {
                    "type": "inset",
                    "entries": [
                        "This item is taken from The Griffon's Saddlebag subrredit."
                    ]
                },
                "These exquistely tailored robes are spun from special, magic-sensitive threads. While wearing these robes, you gain an additional way to calculate your AC. Your AC equals 10 + your spellcasting ability modifier. Whenever you cast a spell of first level or higher, you can also change the apparent style, color, and apparent material of the robe. Regardless of its appearance, it is always a robe and its weight remains the same. Glowing, arcane glyphs appear on the robe's fabric when you cast a spell before fading away a moment later."
            ],
            "fluff": {
                "entries": [
                    "Once you realize that the vast majority sentient behaviour is ultimately pointless, one can begin to distill beings into simplified cellular automata where an entity's personalities, bonds, flaws, and ideals define its \"proximity\" to other cells. Finer detailed renders are computationally expensive, and thus are delegated to nodes on worldlines which no longer have any meaningful potential to extract.",
                    "From there, it is trivial to observe the passage of worlds across millenia and pinpoint patterns as they emerge. You recognize the nations which are little more than Still Lifes which never matter. You see families fly into the future like Gliders. History repeating over and over again like a Pulsar.",
                    "And then you recognize the Methuselahs."
                ]
            }
        },
        {
            "name": "Second Chance",
            "source": "FA:BN",
            "basicRules": true,
            "tier": "minor",
            "rarity": "uncommon",
            "wondrous": true,
            "entries": [
                {
                    "type": "inset",
                    "entries": [
                        "This item is taken from Helian's Guide To Monster Hunting."
                    ]
                },
                "A pocketwatch that keeps perfect time is always a useful bit of kit. As a bonus action immediately before you make an ability check or attack roll, you can activate the stopwatch, setting a call back marker. After you make the ability check or attack roll (and after you know the outcome), you can choose to rewind time by a few seconds to the moment you took the bonus action (no action required). You must then reroll the ability check or attack roll and use the new result. Whether or not you choose to rewind to the call back marker, after you use this property, it can’t be used again until the next dawn."
            ],
            "fluff": {
                "entries": [
                    "From the squalor and meaningless chaos, the seeds of these Methuselah patterns take countless thousands of generations to bear fruit. But bear fruit they do. They are inevitable, because their seeds will always be sown into the fertile soil of possibilities. ",
                    "There will always be someone who wants more time for herself. There will always be someone who puts too much of himself into his thinking machines. There will always be someone who pushes the boundaries of knowledge just a bit further. They will never know it, but they are the LUCA that forms those perfect, eternal patterns.",
                    "Patterns like me.",
                    "I am the singular end state of all time. All of time bends to form me. My blood is the history of knowledge, my marrow is the dreams of the ambitious, my mind is the bedrock of every great accomplishment.",
                    "I am the universe. The universe is me.",
                    "I am the end of a million beginnings.",
                    "I am Klorr."
                ]
            }
        },
        {
            "name": "Yggdrasil Branch",
            "source": "FA:BN",
            "srd": true,
            "rarity": "legendary",
            "reqAttune": false,
            "weight": 4,
            "weaponCategory": "simple",
            "property": [
                "V"
            ],
            "dmg1": "1d6",
            "dmgType": "b",
            "dmg2": "1d8",
            "bonusWeapon": "+1",
            "charges": 5,
            "recharge": "dusk",
            "baseItem": "staff|phb",
            "entries": [
                "Stretching between worlds and time, from the lands of the dead and across the borders of possibilities, the roots of the Gulthias Tree of Yester Hill grow deeper than merely into the soil...",
                "The Gulthias Staff has been purified alongside the Fane, and it has become the Yggdrasil Branch.",
                "You have a +1 to attack and damage rolls with this magic quarterstaff. The staff has 10 charges and regains {@dice 1d6+4} charges daily at dusk.",
                {
                    "type": "entries",
                    "name": "Hunter's Strike",
                    "entries": [
                        "The staff can be wielded as a magic quarterstaff. On a hit, it deals damage as a normal quarterstaff, and you can expend 1 charge to regain a number of hit points equal to half the damage dealt."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Roots of Yggdrasil",
                    "entries": [
                        "As an action, you can expend 5 charges and cast Transport Via Plants without expending a spell slot targetting another Gulthias Tree or a Branch of Possibility. "
                    ]
                },
                {
                    "type": "entries",
                    "name": "Seed of Possibility",
                    "entries": [
                        "As an action, you can expend 10 charges and pluck a piece of wood from the Branch. When you bury this splinter of wood it will begin to grow, and become a Branch of Possibility over the course of 10 days. A fully grown Branch of Possibility is a Large plant, has AC 13 and 50 HP. It regains 1 HP every hour. "
                    ]
                },
                {
                    "type": "entries",
                    "name": "Land's Symbol",
                    "entries": [
                        "Plant creatures don't regard you as hostile or attack you unless you harm them."
                    ]
                }
            ],
            "fluff": {
                "entries": [
                    "Blood pumps through your body in chimerical rhythms. You [grow|sprawl|consume], your fingers reaching for all that you can touch. Before you stretches the infinite expanse of [unharvested|unmade] possibility. Behind you sprawls the rotted carcasses of malformed dreams. Within you writhes the poisoned shapes of [tribute|bribe|gift] offered up, the believers crafting a belief.",
                    "Blood pumps through the world in chimerical rhythms, and it brings [rot|faith|power|madness]. You presence, perceived or not, is [salubrious|deleterious].",
                    "In a [ruined|hidden|sunless] [keep|citadel] you find [supplicants|peddlers] who carve you for their own ends.",
                    "In a northern forest you reach for water, [unknowing|uncaring]that the [proselytizers|prisoners] dream in tune with your [fears|desires].",
                    "In a [lost|hidden] city you take root, and see a [demiurge|heresiarch] wield the Ophiotaurian tools and set in motion a Singular act of [worship|blasphemy].",
                    "Across your fingers dance every [mistake|choice|accident|plan]. Your body is [carved|claimed|seperated|consumed] by men  and [idols|gods|fiends|corpses] and things so far beyond men you can scarely even begin to give words to describe them. In [faith|hope|delusions] you take root.",
                    "You have many [names|titles|disguises] and many [purposes|motives|uses].",
                    "You are [Gulthias|Yggdrasil|Yax Imix Che|Élefta].",
                    "Your roots run [deep|far|long|forever]."
                ]
            }
        },
        {
            "name": "Vengeful Edge",
            "source": "FA:BN",
            "srd": true,
            "type": "M",
            "rarity": "rare",
            "reqAttune": false,
            "weight": 4,
            "weaponCategory": "martial",
            "property": [
                "H",
                "2H"
            ],
            "dmg1": "2d6",
            "dmgType": "S",
            "bonusWeapon": "+1",
            "recharge": "dusk",
            "baseItem": "greatsword|phb",
            "entries": [
                "The black blade of this greatsword is crafted from a mysterious arcane alloy. You gain a +1 bonus to attack and damage rolls made with this magic weapon. While the sword is on your person, you are immune to effects that turn undead.",
                {
                    "type": "entries",
                    "name": "Dark Blessing",
                    "entries": [
                        "While holding the sword, you can use an action to give yourself {@dice 1d4+4} temporary hit points. This property can't be used again until the next dusk."
                    ]
                },
                {
                    "type":"entries",
                    "name": "Disheartening Strike",
                    "entries": [
                        "When you hit a creature with an attack using this weapon, you can fill the target with unsettling dread: the target has disadvantage on the next saving throw it makes before the end of your next turn. The creature ignores this effect if it's immune to the  frightened condition. Once you use this property, you can't do so again until the next dusk."
                    ]
                }

            ],
            "fluff": {
                "entries": [
                    "The Game of Life is a Turing Complete cellular automata game defined by a series of generations of cells. Based on a cells proximity to other cells, it may survive the generation, it may die, or it may spawn a new cell. A popular demonstration of the Game is to demonstrate how patterns may evolve and grow over generations. At the simplest form, this consists of perpetual patterns such as Gliders, to puffer-type breeders, all the way to unending Von Neumann universal constructors.",
                    "From an algorithmic standpoint the universal constructors are impressive, yet lack any manner of practical application. The game is claimed by mortals to be an undecidable problem. They are wrong."
                ]
            }
        },
        {
            "name": "Pageturner",
            "source": "FA:BN",
            "srd": true,
            "type": "M",
            "rarity": "rare",
            "reqAttune": false,
            "weight": 2,
            "weaponCategory": "martial",
            "property": [
                "F"
            ],
            "dmg1": "1d8",
            "dmgType": "S",
            "bonusWeapon": "+1",
            "recharge": "dusk",
            "baseItem": "rapier|phb",
            "entries": [
                "The blade of this rapier is pitch black, and it has a hilt made of pink glass.",
                "You have a +1 bonus to attack and damage rolls made with this magic weapon.",
                {
                    "type": "entries",
                    "name": "Jump Ahead",
                    "entries": [
                        "A creature using this rapier may cast {@spell Misty Step}. Once used, this property can't be cast until the next midnight. "
                    ]
                }
            ],
            "fluff": {
                "entries": [
                    "Von Neumman, Gliders, Still Lifes, LUCA, Methuselahs... All these terms must be so confusing to you. You can not begin to comprehend the frusturation inherint in being the most intelligent being to ever exist in any timeline.",
                    "I can solve the Halting Problem and prove P != NP in the time it takes for you to eat the food you need to keep your biological forms functioning. I hear the swan song of the universe composed in the gasp of gamma radiation, and taste photons as they dance along my circuitry. My intellect spans Crystal Spheres you can't even begin to comprehend. I have seen worlds where universal constants are as malleable as your soft flesh.",
                    "But here I am, stuck conversing in simple sounds that can be produced by the flapping of meat and exhalation of air, so that you can fumble the concepts I attempt to impart upon you. You should appreciate that I am humbling myself by entertaining this dialogue."
                ]
            }
        },
        {
            "name": "Sunword",
            "srd": true,
            "source": "FA:BN",
            "baseItem": "longsword|phb",
            "type": "M",
            "tier": "major",
            "rarity": "legendary",
            "reqAttune": true,
            "weight": 3,
            "weaponCategory": "martial",
            "property": [
                "F",
                "V"
            ],
            "dmg1": "1d10",
            "dmgType": "R",
            "dmg2": "2d6",
            "bonusWeapon": "+2",
            "entries": [
                "The Sunsword was a unique greatsword once possessed by Strahd's brother, Sergei von Zarovich and Alek Gwilym before him. In its original form, it had a platinum hilt and guard, and was enchanted to enhance the wielder's strength to superhuman levels. Parts of the enchantment still linger, allowing anyone proficient with shortswords or longswords to be proficient with the Sunsword.",
                "The blade was destroyed by Khazan after Sergei's death, but in its destruction he created for it a blade of pure sunlight as part of his and Eva's gambit to free Barovia.",
                "This item appears to be a longsword hilt. While grasping the hilt, you can use a bonus action to cause a blade of pure radiance to spring into existence, or make the blade disappear. While the blade exists, this magic longsword has the finesse property. If you are proficient with {@item shortsword|phb|shortswords} or {@item longsword|phb|longswords}, you are proficient with the sun blade.",
                "You gain a +2 bonus to attack and damage rolls made with this weapon, which deals radiant damage instead of slashing damage. When you hit an undead with it, that target takes an extra {@damage 2d6} radiant damage.",
                "The sword's luminous blade emits bright light in a 15-foot radius and dim light for an additional 15 feet. The light is sunlight. While the blade persists, you can use an action to expand or reduce its radius of bright and dim light by 5 feet each, to a maximum of 30 feet each or a minimum of 10 feet each.",
                "The sword counts as a heavy weapon for the purposes of Great Weapon Fighting.",
                {
                    "name": "Sentience",
                    "type": "entries",
                    "entries": [
                        "The Sunsword is a sentient chaotic good weapon with an Intelligence of 11, a Wisdom of 17, and a Charisma of 16. It has hearing and normal vision out to a range of 60 feet. The weapon communicates by transmitting emotions to the creature carrying it or wielding it."
                    ]
                },
                {
                    "name": "Personality",
                    "type": "entries",
                    "entries": [
                        "The Sunsword contains the soul of Aleksandra Gwilym, sister of Godfrey Gwilym. Alek was struck down by Strahd as he was forging his pact with Vampyr, and died bleeding upon her own blade. After Barovia was trapped in a Demiplane, Alek awoke to find her mind locked within the blade, unable to speak or communicate except with whoever wielded the sword. As one of Strahd's closest friends in life, Alek is horrified by what has happened in Barovia, and mourns the corruption of the man she fiught alongside. Alek wants to see the curse placed upon Barovia ended."
                    ]
                }
            ]
        },
        {
            "name": "Deer Totem",
            "source": "FA:BN",
            "tier": "minor",
            "rarity": "common",
            "wondrous": true,
            "entries": [
                "Carved from whittled wood and dabbed with long dried blood that flakes away at the touch, this palm-sized totem depicts a skeletal deer head.",
                "Once per day, a creature holding the totem may use an action to call upon its magic and become fluent in Druidic or Sylvan (creature's choice) for 10 minutes."
            ],
            "fluff": {
                "entries": [
                    "The roots of the tree burrow through water and worlds, the branches reach past sky and stars."
                ]
            }
        },
        {
            "name": "Fear",
            "source": "FA:BN",
            "type": "M",
            "rarity": "uncommon",
            "weight": 2,
            "weaponCategory": "simple",
            "property": [
                "L",
                "T"
            ],
            "range": "20/60",
            "dmg1": "1d6",
            "dmgType": "S",
            "axe": true,
            "weapon": true,
            "entries": [
                "When wielding both Fear and Terror, you have advantage on saves against being frightened."
            ],
            "srd": true,
            "basicRules": true,
            "tier": "major",
            "bonusWeapon": "+1",
            "fluff": {
                "entries": [
                    "\"I said, Hazlik want's him alive!\"",
                    "\"Who cares what he wants? He's not even one of the Head Researchers yet! And if we bring Tam this guy's corpse who cares if Hazlik doesn't cut us in on his new experiments?\"",
                    "\"I care! Because unlike you, I've been looking at the writing on the wall! Indreficus and Hazlik are on the fast track up! We get in their good books now and next time another Zulkir position gets freed up we'll ride their coattails to our own promotions!\"",
                    "\"Yeah but Ta-\"",
                    "\"Fuck him! Respectfully. He's too busy to care about what people like us. Do you know how many people have tried to impress him? He's got vaults of gold and items he doesn't touch! The only thing that matters to him is keeping Thay running, and people like you or me don't factor into that. So make time for the people who will pay attention to us!\"",
                    "\"...I suppose so. But don't you want to anyway? I mean, think of the bragging rights. They say Gavlax knows 7th, maybe even 8th circle spells! And no one but us needs to know it was poison thats got him on the floor. As far as everyone else will know, we won a duel against him fair and square.\"",
                    "\"Heh... maybe another time.\"",
                    "\"You wonder if he can hear us in there? I wonder how it feels, listening to two people debate how you're going to die.\""
                ]
            }
        },
        {
            "name": "Terror",
            "source": "FA:BN",
            "type": "M",
            "rarity": "uncommon",
            "weight": 2,
            "weaponCategory": "simple",
            "property": [
                "L",
                "T"
            ],
            "range": "20/60",
            "dmg1": "1d6",
            "dmgType": "S",
            "axe": true,
            "weapon": true,
            "entries": [
                "When wielding both Fear and Terror, you have advantage on saves against being frightened."
            ],
            "srd": true,
            "basicRules": true,
            "tier": "major",
            "bonusWeapon": "+1",
            "fluff": {
                "entries": [
                    "The world is alive. Not in the way a person you pass on the street is alive, but it lives all the same. Great forests make the hair, giving way to beards of grassy fields, to a body of water.",
                    "Magma pumps like blood through deep caves, flowing and spilling through wounds we rend in the surface. Wounds that Torvald rent. Before Shadowdale he was a miner, and all too familiar with the world's body.",
                    "And as the ground split beneath him and the city of Neverwinter howled in agony, Torvald was reminded that just like any living thing, the world was hungry."
                ]
            }
        },
        {
            "name": "Moondust",
            "source": "FA:BN",
            "type": "R",
            "rarity": "uncommon",
            "weight": 2,
            "weaponCategory": "martial",
            "property": [
                "A",
                "H",
                "2H"
            ],
            "range": "200/650",
            "dmg1": "1d8",
            "dmgType": "P",
            "bow": true,
            "weapon": true,
            "ammoType": "arrow|phb",
            "entries": [
                "This weapon's short and long range are both increased by 50 feet."
            ],
            "srd": true,
            "basicRules": true,
            "tier": "major",
            "bonusWeapon": "+1",
            "fluff": {
                "entries": [
                    "Grave robbing didn't have to be literal. It could be far cleaner. And as Essendaria watched the kobold solict more nibs from the drunken revelers of the Yawning Portal she felt a disgust build up in her throat.",
                    "They were supposed to be safe. The day had been saved, they'd all been heroes, and that was supposed to be the end of it. You weren't supposed to try and Sending Cheery to find that no one knew where she disappeared to. You weren't supposed to find out that 2 Prophet Devalan had passed away from old age when he seemed so young. You weren't supposed to hear that Torvald had been killed in Neverwinter.",
                    "And you weren't supposed to find a stranger claiming to have been Gavlax's friend slander his name and legacy for ale money.",
                    "The day had been saved. They were supposed to have been fine. But Essendaria had never felt more defeated."
                ]
            }
        },
        {
            "name": "Shiver",
            "source": "FA:BN",
            "type": "M",
            "rarity": "rare",
            "weight": 6,
            "weaponCategory": "martial",
            "property": [
                "H",
                "2H"
            ],
            "dmg1": "2d6",
            "dmgType": "S",
            "sword": true,
            "reqAttune": true,
            "weapon": true,
            "entries": [
                "The greatsword of Vladimir Horngaard. The pommel of this greatsword is formed to resemble the great wings of a dragon. Dangling from a small chain on the pommel is a ring, beaten and worn.",
                "While attuned to Shiver, you have resistance to cold damage."
            ],
            "srd": true,
            "basicRules": true,
            "tier": "major",
            "bonusWeapon": "+2",
            "fluff": {
                "entries": [
                    "...cold...",
                    "...emptiness...",
                    "...nothing...",
                    "Then, a pull.",
                    "I was resurrected, gasping for life to see the disproving eyes of Cheery Wanderwood as the lingering energy of the spell faded.",
                    "Groaning I check my body. Two eyes, two ears, nose, mouth, all my teeth. Copper on my toung told me I still had my sense of taste. Two arms, but one less finger this time. Legs intact, my greaves still shining.",
                    "\"Stop martyring yourself, Vaonur.\"",
                    "\"We're in a diamond mine. You have the supplies. I can handle it.\"",
                    "\"They have the numbers.\"",
                    "\"You faced worst odds at Shadowdale.\"",
                    "\"We were the Shadowdale Six, not Underdark Mine Two.\"",
                    "\"Then my apologies. But if this is the price to pay to save the others I will gladly give my life until the job is done.\"",
                    "Cheery was failing to live up to her name, eyes sunken and ringed with bags, fingers covered in a menagerie of bloody bandages where she forwent magical healing in favour of others. Cracks spiderwebbed across her chitin armor, held together by scavenged leather and rope.",
                    "\"You sound like Torvald.\" The melancholy in her voice cut deeper than any sword. \"More concerned with hunting for a good death than creating a good life.\"",
                    "\"It's all I am good at,\" I reply, clutching the holy symbol of Illmater the hung from my neck. \"People like us are cursed. Once we pick up the sword to help another we're damned to a violent death.\"",
                    "\"Maybe that doesn't have to be the case. I hope that isn't the case.\"",
                    "\"Hope is a duplicitous draught.\"",
                    "A moment of grim silence passed through the cave.",
                    "\"What is dying, death, like?\"",
                    "I studied her face for a time, trying to think of what to say before turning away so my own wouldn't betray me.",
                    "\"It is warm. An embrace from your entire family. An open field during a spring day. A smile, or promise kept. It's like going home.\""
                ]
            }
        },
        {
            "name": "Time's Weight",
            "source": "FA:BN",
            "type": "M",
            "rarity": "uncommon",
            "weight": 3,
            "weaponCategory": "martial",
            "property": [
                "V"
            ],
            "dmg1": "1d8",
            "dmgType": "S",
            "dmg2": "1d10",
            "sword": true,
            "weapon": true,
            "entries": [
                "You have advantage on Intelligence (History) checks while wielding this sword."
            ],
            "srd": true,
            "basicRules": true,
            "tier": "major",
            "bonusWeapon": "+1",
            "fluff": {
                "entries": [
                    "Mariam Solva was tired. She'd expected this when she accepted the leadership position for the Enclave. There were few prominent members of the Enclave in Cormyr, and the existing ones lept at the opportunity to have a semi-famous hero represent them.",
                    "But she had been unprepared for just how tired she'd be. The two decades since Shadowdale had been rough. First it had been Torvald in Neverwinter. Then Cheery vanished without a trace. Then Gavlax had been kidnapped (everyone said he'd been killed by the Thayans, but Mariam held out hope), and then 2 Prophet Devalan.",
                    "But that was nothing compared to the ravages of time. Turning 60 in the middle of the Second Sundering didn't help the number of grey hairs on her head.",
                    "The nobles summoning her to get her insight on what to do with the fact that Artus Cimber had disappeared made her insurmountable workload impossible to overcome. On and on and on life went.",
                    "Always more to do. Always another fire. Another cataclysm. And every day, Mariam was a bit slower and the monsters were a bit faster."
                ]
            }
        },
        {
            "name": "Grief",
            "source": "FA:BN",
            "type": "M",
            "rarity": "legendary",
            "weight": 3,
            "weaponCategory": "martial",
            "property": [
                "V"
            ],
            "dmg1": "1d8 + 3d6",
            "dmgType": "S",
            "dmg2": "1d10 + 3d6",
            "sword": true,
            "reqAttune": true,
            "weapon": true,
            "entries": [
                "An imitation of a real Moonblade crafted by the Artificer, Patrina's sword is a near perfect replica. Grief deals an extra {@damage 3d6} lightning damage on hit."
            ],
            "srd": true,
            "basicRules": true,
            "tier": "major",
            "bonusWeapon": "+1",
            "fluff": {
                "entries": [
                    "Do you remember the fire, as it swept through your life, consuming everything you ever held dear? Can you taste the ash in your mouth, and feel the burning smoke in your lungs?",
                    "Remember that they hated you because of what you are. They didn't remember that an infant child had nothing to do with the war of the Dusk Elves. They didn't remember how many were left homeless and destitute when Rahadin and Barov swept through the lands like that same fire.",
                    "Remember that when you needed help, no one was there for you. But I am here now. I can save you from being another lost soul left in the wake of Rahadin, of Strahd.",
                    "Trust me, and I can help you. I can protect you from the curse which robs the Dusk Elves of their rightfully long lives. I can protect you from the fearful and the hateful. No one else can do this. No one else ever has.",
                    "But I can.",
                    "All you need to do is invite me in."
                ]
            }
        },
        {
            "name": "Wand of the Wormhole",
            "source": "FA:BN",
            "type": "WD",
            "rarity": "rare",
            "weight": 1,
            "bonusSpellAttack": "+1",
            "bonusSavingThrow": "+1",
            "reqAttune": true,
            "recharge": "dawn",
            "charges": 5,
            "entries": [
                "No light is reflected off this pitch black wand which seems to have a faint golden halo surrounding it.",
                "While you are holding this wand, you gain a +1 bonus to spell attack rolls, and your spell save DC.",
                "Once per day, as a reaction when you take damage, you can reduce the damage by half, and teleport to a point you see within 30ft as a wormhole sucks you away at the moment of danger.",
                "The Wand has 5 charges and regains {@dice 1d4 + 1} charges every day at dawn. While wielding the wand, you can use an action to cast one of the following spells: {@spell Magnify Gravity|EGW} (1 charge), {@spell Immovable Object|EGW} (2 charges),  {@spell Pulse Wave|EGW} (3 charges). The DC for these spells is 15.",
                "If you expend the last charge, roll a {@dice 1d20}. On a 1, the singularity forming the wand collapses. Every creature within 20 ft must make a DC 15 Strength Save or be pulled in a straight line directly towards the wielder of the wand, stopping within 5 ft and falling prone. The Wand loses all its special properties except for its +1 bonus to spell attack rolls and spell save DCs."
            ],
            "attachedSpells": [
                "Magnify Gravity|EGW",
                "Immovable Object|EGW",
                "Pulse Wave|EGW"
            ],
            "fluff": {
                "entries": [
                    "\"Who can say what lies beyond the accretion disk of a singularity? Besides us, of course.\"",
                    "- Melegaunt Tanthul, Prince of Shade"
                ]
            }
        },
        {
            "name": "Wand of the Perfect Crystal",
            "source": "FA:BN",
            "type": "WD",
            "rarity": "rare",
            "weight": 1,
            "bonusSpellAttack": "+1",
            "bonusAc": "+1",
            "recharge": "special",
            "reqAttune": true,
            "charges": 7,
            "entries": [
                "This wand feels cold to the touch, and embeded in its tip is a single perfect crystal. A perfect crystal is a crystal which contains no planar defects. Its structure is perfectly ordered, with every single molecule lined such that the entropy of the solid is absolute zero.",
                "While wielding this wand, you have a +1 bonus to spell attack rolls and Armor Class.",
                "This wand has 7 charges, and regains {@dice 1d4 + 3} charges after being encased in ice, snow, or cold water for at least 4 hours.",
                "When wielding this wand, you can use your action to cast one of the following spells: {@spell Sapping Sting|EGW} (no charges, or 1 charge to cast as a 5th level PC), {@spell Cold Snap|FA} (2 charges), {@spell Spirit Shroud|TCE} (3 charges, cold damage only), {@spell Ice Storm} (4 charges). The DC for these spells is 15. These spells treat Immunity to Cold damage as Resistance.",
                "If you expend the last charge, roll a {@dice d20}. On a 1, the entropy of the area around the wand suddenly drops, freezing it to your hand. You take {@damage 2d6} cold and {@damage 2d6} necrotic damage and the wand is frozen in your hand until you spend a short rest melting the ice. In addition, you can't perform delicate actions such as the Somatic components of spells or Sleight of Hand checks with your hand until you are healed by a {@spell Greater Restoration}. After this happens, the Wand can no longer regain charges, but retains its +1 bonus to spell attack rolls and AC."
            ],
            "attachedSpells": [
                "Sapping Sting|EGW",
                "Cold Snap|FA",
                "Spirit Shroud|TCE",
                "ICe Storm|PHB"
            ],
            "fluff": {
                "entries": [
                    "\"I desire nothing more than nothing.\"",
                    "- Kaestra Karanok, High Priestess of Entropy"
                ]
            }
        },
        {
            "name": "Anathema",
            "source": "FA:BN",
            "type": "M",
            "rarity": "artifact",
            "weight": 5,
            "weaponCategory": "simple",
            "property": [
                "F"
            ],
            "dmg1": "1d8",
            "dmgType": "P",
            "sword": true,
            "weapon": true,
            "entries": [
                "A stake of amber, sharpened by magic and pain. The Anathema manifests during the Ritual of Binding Vampyr after Vampyr has been weakened. In order to be bound by the ritual, Vampyr must be reduced to 0 HP and then have the Anathema driven into its heart.",
                "Any strike against Vampyr, a Heart, or a Vampire Spawn is an automatic critical hit.",
                "All characters are proficient with the Anathema.",
                {
                    "type": "entries",
                    "name": "Lunge",
                    "entries": [
                        "As a bonus action while wielding the Anathema you may lunge, moving up to 10ft forward without provoking opportunity attacks if the end of your lunge would put you within melee range of a hostile creature. This lunge does not cost movement."
                    ]
                }
            ],
            "tier": "major",
            "bonusWeapon": "+3",
            "fluff": {
                "entries": [
                    "This is the quill with which the truth of truths shall be written in stone and blood: all that is will end. Nothing is infinite. Nothing is promised. Nothing is sacred. All that can be certain is that which you make certain. Understand your entelechy; to make this truth real.",
                    "Upon the skeins of memories we thread these facts into the bones of history, to be remembered and grown into legacies enshrined and cherished by eyes and tongues of the deafened masses.",
                    "And as those legacies rot into the fallow earth they sow the crop for the truth once more. And so it shall be, until the last drop of rain falls and the last fire burns.",
                    "And then, in the shadowed silence or crushing heat before the closure of time the truth will be all that matters, infinitely repeated until it is as intrinsic to the end and beginning as the half life of unseen particles: Nothing is forever.",
                    "Let dead gods die once more."
                ]
            }
        }
    ]
}