{
    "_meta": {
        "sources": [
            {
                "json": "FA:V",
                "abbreviation": "FA:V",
                "full": "ForbiddenArcana: Vyn",
                "authors": [
                    "ForbiddenArcana"
                ],
                "convertedBy": [
                    "ForbiddenArcana"
                ],
                "version": "1.0",
                "targetSchema": "1.2.0",
                "color": "e4c9a8"
            }
        ]
    },
    "baseitem": [
        {
            "name": "Blunted Arrow",
            "source": "FA:V",
            "type": "A",
            "rarity": "none",
            "weight": 0.05,
            "value": 5,
            "entries": [
                "These arrows have blunted arrowheads to avoid piercing their target, and deal bludgeoning damage instead of piercing. Whenever you hit a creature or object using this ammunition, the target has resistance to the damage dealt by the attack, and if the damage reduces a creature to 0 hit points but doesn't kill it outright, the creature falls {@condition unconscious} and is stable."
            ]
        },
        {
            "name": "Blunted Bolt",
            "source": "FA:V",
            "type": "A",
            "rarity": "none",
            "weight": 0.075,
            "value": 5,
            "entries": [
                "These crossbow bolts have blunted tips to avoid piercing their target, and deal bludgeoning damage instead of piercing. Whenever you hit a creature or object using this ammunition, the target has resistance to the damage dealt by the attack, and if the damage reduces a creature to 0 hit points but doesn't kill it outright, the creature falls {@condition unconscious} and is stable."
            ]
        },
        {
            "name": "Brigandine",
            "source": "FA:V",
            "type": "HA",
            "rarity": "none",
            "weight": 50,
            "value": 2000,
            "ac": 16,
            "strength": "15",
            "armor": true,
            "stealth": true,
            "entries": [
                "This armor is a garment of heavy cloth or leather, lined internally with many small steel plates riveted to the fabric. Flexible chain mail protects the inside of the joints. It includes a tunic that can be worn over the armor, often stylized with family or faction symbology, which fully covers the metal. Since the metal is not exposed, it's not considered to be metal armour for the purpose of effects like {@spell Shocking Grasp}."
            ]
        },
        {
            "name": "Buckler",
            "source": "FA:V",
            "type": "S",
            "rarity": "none",
            "weight": 2,
            "value": 100,
            "ac": 1,
            "entries": [
                "A shield is made from wood or metal and is carried in one hand. You can benefit from only one shield at a time.",
                "Wielding a buckler increases your AC by 1, and it counts as an item instead of as armour for the purpose of (un)equipping it.",
                "Bucklers require proficiency with either shields or light armor to wield effectively."
            ]
        },
        {
            "name": "Gambeson (2-layer)",
            "source": "FA:V",
            "type": "MA",
            "rarity": "none",
            "weight": 6,
            "value": 200,
            "ac": 12,
            "armor": true,
            "entries": [
                "Gambeson consists of quilted layers of cloth and batting. This is a shoddy, mass-produced vest with fewer layers than normal, sacrificing protection for affordability. It can be worn as padding under heavier armors."
            ]
        },
        {
            "name": "Gambeson (4-layer)",
            "source": "FA:V",
            "type": "MA",
            "rarity": "none",
            "weight": 12,
            "value": 750,
            "ac": 13,
            "armor": true,
            "entries": [
                "Gambeson consists of quilted layers of cloth and batting. This is a well-padded jacket or vest, but is still light enough to allow relatively unrestricted movement and to be worn as padding under heavier armors."
            ]
        },
        {
            "name": "Gambeson (6-layer)",
            "source": "FA:V",
            "type": "MA",
            "rarity": "none",
            "weight": 18,
            "value": 1000,
            "ac": 14,
            "armor": true,
            "stealth": true,
            "entries": [
                "Gambeson consists of quilted layers of cloth and batting. This is a heavy coat, offering the best protection that fabric alone can but somewhat encumbering movement."
            ]
        },
        {
            "name": "Gambeson (Masterwork)",
            "source": "FA:V",
            "type": "MA",
            "rarity": "none",
            "weight": 12,
            "value": 6000,
            "ac": 14,
            "armor": true,
            "entries": [
                "Gambeson consists of quilted layers of cloth and batting. This is a heavy greatspider silk coat with more layers over the vitals than the joints, offering equal protection to thicker gambesons without heavily restricting movement."
            ]
        },
        {
            "name": "Greatbow",
            "source": "FA:V",
            "type": "R",
            "rarity": "none",
            "weight": 3,
            "value": 800,
            "weaponCategory": "martial",
            "property": [
                "A",
                "H",
                "S",
                "2H"
            ],
            "range": "250/1000",
            "dmg1": "1d10",
            "dmgType": "P",
            "bow": true,
            "weapon": true,
            "ammoType": "arrow|phb",
            "entries": [
                {
                    "type": "entries",
                    "name": "Special",
                    "entries": [
                        "If you have a Strength score of 12 or less, you can't fire this weapon."
                    ]
                }
            ]
        },
        {
            "name": "Hand Cannon (2 lb)",
            "source": "FA:V",
            "type": "R",
            "rarity": "none",
            "weight": 30,
            "weaponCategory": "simple",
            "property": [
                "A",
                "H",
                "S",
                "2H"
            ],
            "range": "60/240",
            "dmg1": "2d12",
            "dmgType": "B",
            "savingThrow": [
                "constitution"
            ],
            "weapon": true,
            "entries": [
                {
                    "type": "entries",
                    "name": "Special",
                    "entries": [
                        "Firing this weapon creates a thunderous boom audible out to 1 mile. When fired in an indoor space, all creatures within 30 feet of it must succeed on a DC 13 Constitution saving throw or take {@damage 1d12} thunder damage and be {@condition deafened} for one minute. Creatures within 5 feet of it have disadvantage on the save.",
                        "After firing this weapon, you must use an action to reload it before you can fire it again. If you have a Strength score of 12 or less, you are knocked {@condition prone} and pushed backwards 5 feet when you fire this weapon."
                    ]
                }
            ]
        },
        {
            "name": "Longsword",
            "source": "FA:V",
            "type": "M",
            "rarity": "none",
            "weight": 3,
            "value": 150,
            "weaponCategory": "martial",
            "property": [
                "S",
                "V"
            ],
            "dmg1": "1d8",
            "dmgType": "S",
            "dmg2": "1d10",
            "sword": true,
            "weapon": true,
            "entries": [
                {
                    "type": "entries",
                    "name": "Special",
                    "entries": [
                        "This weapon also gains the Finesse property when used with two hands."
                    ]
                }
            ]
        },
        {
            "name": "Military Crossbow",
            "source": "FA:V",
            "type": "R",
            "rarity": "none",
            "weight": 22,
            "value": 800,
            "weaponCategory": "martial",
            "property": [
                "A",
                "H",
                "LD",
                "S",
                "2H"
            ],
            "range": "200/800",
            "dmg1": "1d12",
            "dmgType": "P",
            "crossbow": true,
            "weapon": true,
            "ammoType": "crossbow bolt|phb",
            "entries": [
                {
                    "type": "entries",
                    "name": "Special",
                    "entries": [
                        "If you have a Strength score of 12 or less, it takes an action to load this weapon, and after you take this action you are {@condition restrained} and cannot fire it until the start of your next turn. You also can't load it on a turn after moving 5 feet or more, or if you're not proficient with it."
                    ]
                }
            ]
        },
        {
            "name": "Pike",
            "source": "FA:V",
            "type": "M",
            "rarity": "none",
            "weight": 18,
            "value": 100,
            "weaponCategory": "martial",
            "property": [
                "H",
                "S",
                "2H"
            ],
            "dmg1": "1d10",
            "dmgType": "P",
            "weapon": true,
            "entries": [
                {
                    "type": "entries",
                    "name": "Special",
                    "entries": [
                        "This weapon can't be used to attack creatures within 5 feet of you, but adds 10 feet to your reach (instead of 5) when you attack with it. This property also determines your reach for opportunity attacks with the weapon. Longer pikes that add 15 feet to the wielder's reach are also commonly available, but can't be used to attack creatures within 10 feet of the wielder."
                    ]
                }
            ]
        },
        {
            "name": "Sending Relay",
            "source": "FA:V",
            "tier": "minor",
            "rarity": "uncommon",
            "reqAttune": true,
            "wondrous": true,
            "entries": [
                "This smooth stone resembles a Sending Stone, but has a carving of a circular chain comprised of six links. Whenever you are the caster or target of a {@spell Sending} spell, you can choose to relay the message and response to up to 5 other willing creatures you can see. Those creatures recognize that they are receiving relayed messages from you, and recognize the other creature involved with the {@spell Sending} if they know the other creature.",
                "Additionally, whenever you cast {@spell Sending} while touching a willing creature attuned to a Sending Relay, you can target any creature they are familiar with."
            ],
            "hasFluffImages": true
        },
        {
            "name": "Swordbreaker",
            "source": "FA:V",
            "type": "M",
            "rarity": "none",
            "weight": 2,
            "value": 50,
            "weaponCategory": "martial",
            "property": [
                "L",
                "S"
            ],
            "dmg1": "1d4",
            "dmgType": "B",
            "weapon": true,
            "entries": [
                {
                    "type": "entries",
                    "name": "Special",
                    "entries": [
                        "When you're wielding a swordbreaker with proficiency and take the {@action Attack} action, you can attempt to disarm a creature wielding a melee weapon or holding a wand-like object in one hand. If you're able to make multiple attacks with the {@action Attack} action, this attempt replaces one of them. If you have a free hand or are wielding two swordbreakers, you can attempt to disarm objects held with two hands.",
                        "You make a melee attack with the swordbreaker, and the creature makes a contesting melee attack with the object it's holding. You have disadvantage on the attack if the creature's object is not sword-like. Neither attack causes any damage or other ill effect, but if you win the contest, the creature drops its object."
                    ]
                }
            ]
        },
        {
            "name": "Timepiece (High-quality)",
            "source": "FA:V",
            "type": "G",
            "rarity": "none",
            "weight": 2,
            "value": 500,
            "entries": [
                "A timepiece is a roughly hand-sized enclosure of wood or metal containing the intricate mechanisms required to keep time, with a lid or additional case to protect the clock face. When closed, most cases have rudimentary water resistance. The clock itself typically has 2 hands, hour and minute. As present timepiece accuracy is not great, most clock faces only have 12 marks, indicating each hour and 5-minute interval.",
                "High-quality timepieces go for 5 gold, and are accurate to within 5 minutes over 2 hours and to within 2 hours over 24 hours. They rarely run fast, typically running slow instead, so that inaccuracy can be somewhat mentally accounted for. The enclosure must be opened to access the mechanism to wind it with a key, but high-quality timepieces are good for close to 48 hours between rewinds."
            ]
        },
        {
            "name": "Timepiece (Mid-quality)",
            "source": "FA:V",
            "type": "G",
            "rarity": "none",
            "weight": 2,
            "value": 400,
            "entries": [
                "A timepiece is a roughly hand-sized enclosure of wood or metal containing the intricate mechanisms required to keep time, with a lid or additional case to protect the clock face. When closed, most cases have rudimentary water resistance. The clock itself typically has 2 hands, hour and minute. As present timepiece accuracy is not great, most clock faces only have 12 marks, indicating each hour and 5-minute interval.",
                "Mid-quality timepieces go for 4 gold, and are accurate to within 8 minutes over 2 hours and to within 3 hours over 24 hours. They rarely run fast, typically running slow instead, so that inaccuracy can be somewhat mentally accounted for. The enclosure must be opened to access the mechanism to wind it with a key, but mid-quality timepieces are good for close to 36 hours between rewinds."
            ]
        },
        {
            "name": "Timepiece (Low-quality)",
            "source": "FA:V",
            "type": "G",
            "rarity": "none",
            "weight": 2,
            "value": 300,
            "entries": [
                "A timepiece is a roughly hand-sized enclosure of wood or metal containing the intricate mechanisms required to keep time, with a lid or additional case to protect the clock face. When closed, most cases have rudimentary water resistance. The clock itself typically has 2 hands, hour and minute. As present timepiece accuracy is not great, most clock faces only have 12 marks, indicating each hour and 5-minute interval.",
                "Low-quality timepieces go for 3 gold, and are accurate to within 10 minutes over 2 hours and to within 4 hours over 24 hours. They rarely run fast, typically running slow instead, so that inaccuracy can be somewhat mentally accounted for. The enclosure must be opened to access the mechanism to wind it with a key, but low-quality timepieces are good for close to 24 hours between rewinds."
            ]
        },
        {
            "name": "Timepiece (Timer)",
            "source": "FA:V",
            "type": "G",
            "rarity": "none",
            "weight": 2,
            "value": 200,
            "entries": [
                "A timepiece is a roughly hand-sized enclosure of wood or metal containing the intricate mechanisms required to keep time, with a lid or additional case to protect the clock face. When closed, most cases have rudimentary water resistance. The clock itself typically has 2 hands, hour and minute. As present timepiece accuracy is not great, most clock faces only have 12 marks, indicating each hour and 5-minute interval.",
                "Timepiece timers go for 2 gold, and lose accuracy quickly so they're only used to keep rough track of a handful of hours. They're accurate to within 15 minutes over 2 hours and to within 1 hour over 6 hours. They rarely run fast, typically running slow instead, so that inaccuracy can be somewhat mentally accounted for. The enclosure must be opened to access the mechanism to wind it with a key. Timepiece timers run for up to 6 hours before the mechanism is halted as it strikes a small bell."
            ]
        },
        {
            "name": "Tower Shield",
            "source": "FA:V",
            "type": "S",
            "rarity": "none",
            "weight": 10,
            "strength": 15,
            "value": 400,
            "ac": 3,
            "entries": [
                "A shield is made from wood or metal and is carried in one hand. You can benefit from only one shield at a time.",
                "Wielding a tower shield increases your AC by 3. While wielding one, you can plant it as an action to create total cover from one direction. You are {@condition restrained} for as long as you brace it, and can stop bracing it on your turn (no action required).",
                "Tower shields require proficiency with both shields and heavy armor and a Strength score of 15 or higher to wield effectively."
            ]
        },
        {
            "name": "Whip",
            "source": "FA:V",
            "type": "M",
            "rarity": "none",
            "weight": 3,
            "value": 30,
            "weaponCategory": "martial",
            "property": [
                "F",
                "L",
                "S"
            ],
            "dmg1": "1d4",
            "dmgType": "S",
            "weapon": true,
            "entries": [
                {
                    "type": "entries",
                    "name": "Special",
                    "entries": [
                        "This weapon adds 10 feet to your reach (instead of 5) when you attack with it. This property also determines your reach for opportunity attacks with the weapon."
                    ]
                }
            ]
        }
    ],
    "feat": [
        {
            "name": "Battering Ram",
            "source": "FA:V",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "con"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "inset",
                    "entries": [
                        "This feat is a buffed version of {@feat Charger|PHB} published in the Player's Handbook."
                    ]
                },
                "When you need to spend precious time moving into position, you make up for it by taking advantage of your momentum to make a deadlier entrance:",
                {
                    "type": "list",
                    "items": [
                        "When you use your action to {@action Dash}, you can use a bonus action to make one melee weapon attack or to {@action shove} or {@action grapple} a creature. If you move at least 20 feet in a straight line immediately before taking this bonus action, you have advantage on the attack roll or ability check.",
                        "If you take this bonus action, you gain a +5 bonus to the attack's damage roll (if you make a weapon attack and hit), can push the target twice as far (if you shove and succeed), or can move the grappled target at full speed until the end of your turn (if you grapple and succeed)."
                    ]
                }
			]
        },
        {
            "name": "Crack Shot",
            "source": "FA:V",
            "ability": [
                {
                    "dex": 1
                }
            ],
            "entries": [
                {
                    "type": "inset",
                    "entries": [
                        "This feat is a nerfed version of {@feat Sharpshooter|PHB} published in the Player's Handbook."
                    ]
                },
                "You have mastered ranged weapons and can make shots that others find impossible. You gain the following benefits when using ranged weapons you are proficient with:",
                {
                    "type": "list",
                    "items": [
                        "Your ranged weapon attacks ignore half cover, and treat three-quarters cover as half cover.",
                        "Before you make a ranged weapon attack, you can choose to forgo applying your proficiency bonus to the attack roll, and instead apply it to the attack's damage if it hits."
                    ]
                }
			]
        },
        {
            "name": "Executioner",
            "source": "FA:V",
            "entries": [
                {
                    "type": "inset",
                    "entries": [
                        "This feat is a nerfed version of {@feat Great Weapon Master|PHB} published in the Player's Handbook."
                    ]
                },
                "You've learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "On your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action.",
                        "Before you make a melee attack with a heavy weapon that you are proficient with, you can choose to forgo applying your proficiency bonus to the attack roll, and instead apply it to the attack's damage if it hits."
                    ]
                }
            ]
        }
    ],
    "optionalfeature": [
        {
            "name": "Friend of One",
            "prerequisite": [
                {
                    "level": {
                        "level": 9,
                        "class": {
                            "name": "Warlock"
                        }
                    }
                }
            ],
            "entries": [
                "You can cast {@spell Bond of Arcana|FA:V} once using a warlock spell slot. You can't do so again until you finish a long rest."
            ],
            "source": "FA:V",
            "featureType": [
                "EI"
            ]
        },
        {
            "name": "Shield Slinger",
            "entries": [
                "You can manipulate your shield with a sling around your neck instead of your hands. As a bonus action, you can don or doff your shield, swinging it from across your back to by your side. When your shield is donned in this way, it has a -1 penalty to its AC bonus, but can be used without requiring a free hand."
            ],
            "source": "FA:V",
            "featureType": [
                "FS:F",
                "FS:P",
                "FS:R"
            ]
        }
    ],
    "race": [
    ],
    "spell": [
        {
            "name": "Artificial Permanence",
            "source": "FA:V",
            "level": 3,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "hour"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": {
                    "text": "varies",
                    "consume": true
                }
            },
            "duration": [
                {
                    "type": "special"
                }
            ],
            "entries": [
                "Choose a spell of 2nd level or lower that you can cast, targets a single creature, object, or area, and has a duration of 10 minutes or longer. The spell must have the ritual tag or a casting time of either 1 minute or 10 minutes; if it is of the school of Abjuration, Divination, Enchantment, Illusion, or Transmutation, it can instead have a casting time of 1 action or bonus action. If the spell has a range of self, you can cast it on another creature or an object instead. For example, you could make {@spell Locate Object} permanent on a compass, or {@spell Comprehend Languages} permanent on an ally. Creatures which have 5th or higher level spell slots cannot be targeted by this spell due to interference from their own casting abilities.",
                "You cast that spell as part of casting this spell, but its effects do not immediately take hold. If you cast both spells this way every day for 5 days per level of the chosen spell, with the same target every time, the chosen spell becomes permanent on the target and does not require concentration. Cantrips require 2 days.",
                "You must expend appropriate spell slots and material components (if applicable) for each casting of the spells. If the chosen spell does not have consumed material components, it instead costs 1 gp per level of the chosen spell for each casting. Cantrips cost 5 sp per casting. It costs half as much for wizards of the same school as the spell they are making permanent.",
                "A permanent spell can be dispelled as though Permanence were the active spell, but an ability check is always required and the DC is increased by 3. All permanent spells on a target end immediately if the target ever gains 5th or higher level spell slots."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "When you cast this spell using a spell slot of 4th level or higher, the chosen spell can be of any level lower than the level at which you cast this spell."
                    ]
                }
            ],
            "fluff": {
                "type": "entries",
                "entries": [
                    ""
                ]
            },
            "areaTags": [
                "ST"
            ],
            "miscTags": [
                "PRM"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Artificer",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Mordenkainen's Magic Foil",
            "source": "FA:V",
            "level": 3,
            "school": "I",
            "time": [
                {
                    "number": 1,
                    "unit": "minute"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": {
                    "text": "a small triangle of silk",
                    "consume": false
                }
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 24
                    },
                    "concentration": false
                }
            ],
            "entries": [
                "You place an illusion on a willing creature or an object that isn't being carried or worn by another creature. You must touch the target throughout the casting of the spell. Upon the spell's completion, divination spells and short rests spent inspecting the target reveal false information about it.",
                "You change the way the target appears to spells and effects, such as {@spell Identify} or a short rest spent identifying or trying to attune to the target, that identify spells and magical properties. You can hide such spells and properties from detection (but cannot hide this spell), make it seem like the target has a specific property or spell active on it, or both at once. You must be able to cast a given spell or succeed on an Arcana check, DC equal to 15 + the spell's level, to be able to create the illusion of it on the target.",
                "The spell's effects lasts for the duration. If you cast this spell on the same target every day for 30 days, placing the same effect on it each time, the illusion lasts until it is dispelled.",
                "{@spell Identify} reveals that this spell is active on the target, but not any effects it's hiding. If the caster of {@spell Identify} succeeds on an ability check using their spellcasting ability against the Magic Foil caster's save DC, or if they cast {@spell Identify} at the same or higher level than this spell was cast at, they learn both the real and the false information, including that the false information is fake."
            ],
            "fluff": {
                "type": "entries",
                "entries": [
                    ""
                ]
            },
            "areaTags": [
                "ST"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Rautheene's Social Escape",
            "source": "FA:V",
            "level": 3,
            "school": "I",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "m": {
                    "text": "a piece of ammunition",
                    "consume": false
                }
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "For the spell's duration, a creature you touch can become {@condition invisible} (along anything it is wearing or carrying) as a bonus action.",
                "The target becomes visible again when it uses another bonus action to do so, when it attacks or casts a spell, or after 30 seconds have passed. Once that happens, it can't use this spell to turn invisible for the next minute.",
                "If the target is invisible when the spell ends, it receives a mental ping to warn it the spell is ending and doesn't immediately become visible due to the spell ending."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "When you cast this spell using a spell slot of 5th level or higher, the duration is concentration up to 8 hours. If you use a spell slot of 8th level or higher, the duration is 24 hours."
                    ]
                }
            ],
            "fluff": {
                "type": "entries",
                "entries": [
                    "This spell is said to have been written by a beautiful woman, apprenticed to a powerful spellcaster, who was tired of dealing with blatant bullshit from her peers. The fact that it is of the same level as Nondetection lends credence to this myth."
                ]
            },
            "conditionInflict": [
                "invisible"
            ],
            "areaTags": [
                "ST"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Artificer",
                        "source": "PHB"
                    },
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Bond of Arcana",
            "source": "FA:V",
            "level": 5,
            "school": "A",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": {
                    "text": "a bit of wolfhound fur",
                    "consume": false
                }
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "You lay a reassuring hand on a humanoid. For the spell's duration, they regain 1 HP when they start their turn at 0 HP, and have advantage on Constitution and Charisma saves.",
                "If the spell lasts for its full duration and you are both willing, your souls become permanently linked. There are benefits and drawbacks for each of you:",
                {
                    "type": "entries",
                    "name": "Bond",
                    "entries": [
                        "If either of you has or gains a mental sense, such as from Divine Sense or {@spell Locate Object}, the other gains its benefits while the ability is active. You both gain a mental ability to sense the distance and direction to each other, as well as each other's emotions and pain. This ability can be suppressed by either of you."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Enhanced Agility",
                    "entries": [
                        "Their Dexterity score increases to 15, if it's not higher. If theirs increased, your Dexterity score decreases by 2."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Tethered Essence",
                    "entries": [
                        "They have advantage on death saving throws, and effects that would instantly kill them at 0 HP are negated. You have disadvantage on death saving throws, and if you are reduced to 1 HP you take 1 point of damage which can't be reduced or prevented in any way. When either of you is reduced to half HP or 0 HP, the other takes 5 points of psychic damage."
                    ]
                },
                "If they die, you are set to five levels of {@variantrule Stress and Agitation/Exhaustion|FA|Agitation} and the effects of the bond cease. Passing a DC 17 Charisma save delays taking the agitation until any adrenaline runs out.",
                "If you die, they lose the bond's benefits except for the Dexterity increase, and are set to five levels of {@variantrule Stress and Agitation/Exhaustion|FA|Exhaustion} after any adrenaline runs out. They have disadvantage on death saves for a month while experiencing a fatalistic desire for vengeance, then lose the bond's Dexterity increase.",
                "You can only bond one humanoid at a time, and there is currently no confirmed way to release or suppress the bond without consequence. However, you can transfer your side of the bond to someone else if you both cast this spell targeting each other, either transferring it immediately or specifying a condition to trigger the transfer.",
                "The permanent bond cannot be dispelled by Dispel Magic."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "When you bond someone, their Dexterity score increases to 10 + the level you cast this spell at, and the psychic damage from Tethered Essence is reduced by 1 per slot level above 5th. If you cast it at 9th level, you don't suffer the bond's penalties, except those for death."
                    ]
                }
            ],
            "fluff": {
                "type": "entries",
                "entries": [
                    "This is a highly experimental spell in the world of Vyn. There may be mechanics not explicitly mentioned in the spell text. When you learn about this spell, a warning is also imparted to try to avoid edge cases."
                ]
            },
            "areaTags": [
                "ST"
            ],
            "miscTags": [
                "HL"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Bond of Faith",
            "source": "FA:V",
            "level": 5,
            "school": "A",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": {
                    "text": "a bit of wolfhound fur",
                    "consume": false
                }
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "You lay a reassuring hand on a humanoid. For the spell's duration, they regain HP equal to your spellcasting ability modifier at the start of each of their turns, and have advantage on Constitution and Charisma saves.",
                "If the spell lasts for its full duration and you are both willing, your souls become permanently linked. There are benefits and drawbacks for each of you:",
                {
                    "type": "entries",
                    "name": "Bond",
                    "entries": [
                        "If either of you has or gains a mental sense, such as from Divine Sense or {@spell Locate Object}, the other gains its benefits while the ability is active. You both gain a mental ability to sense the distance and direction to each other, as well as each other's emotions and pain. This ability can be suppressed by either of you."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Tethered Essence",
                    "entries": [
                        "They have advantage on death saving throws, and effects that would instantly kill them at 0 HP are negated. You have disadvantage on death saving throws, and if you are reduced to 1 HP you take 1 point of damage which can't be reduced or prevented in any way. When either of you is reduced to half HP or 0 HP, the other takes 5 points of psychic damage."
                    ]
                },
                "If they die, you are set to five levels of {@variantrule Stress and Agitation/Exhaustion|FA|Agitation} and the effects of the bond cease. Passing a DC 17 Charisma save delays taking the agitation until any adrenaline runs out.",
                "If you die, they lose the bond's benefits except for the Dexterity increase, and are set to five levels of {@variantrule Stress and Agitation/Exhaustion|FA|Exhaustion} after any adrenaline runs out. They have disadvantage on death saves for a month while experiencing a fatalistic desire for vengeance, then lose the bond's Dexterity increase.",
                "You can only bond one humanoid at a time, and there is currently no confirmed way to release or suppress the bond without consequence. However, you can transfer your side of the bond to someone else if you both cast this spell targeting each other, either transferring it immediately or specifying a condition to trigger the transfer.",
                "The permanent bond cannot be dispelled by Dispel Magic."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "For the spell's duration, the target regains an additional hit point at the start of their turns for each slot level above 5th. When you bond someone, the psychic damage from Tethered Essence is reduced by 1 per slot level above 5th. If you cast it at 9th level, you don't suffer the bond's penalties, except those for death."
                    ]
                }
            ],
            "fluff": {
                "type": "entries",
                "entries": [
                    "This is a highly experimental spell in the world of Vyn. There may be mechanics not explicitly mentioned in the spell text. When you learn about this spell, a warning is also imparted to try to avoid edge cases."
                ]
            },
            "areaTags": [
                "ST"
            ],
            "miscTags": [
                "HL"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Cleric",
                        "source": "PHB"
                    },
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Paladin",
                        "source": "PHB"
                    },
                    {
                        "name": "Ranger",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Arcane Permanence",
            "source": "FA:V",
            "level": 6,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "hour"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": {
                    "text": "varies",
                    "consume": true
                }
            },
            "duration": [
                {
                    "type": "special"
                }
            ],
            "entries": [
                "Choose a spell of 1st level or lower that you can cast, targets a single creature, object, or area, and has a duration of 10 minutes or longer. The spell must have the ritual tag or a casting time of either 1 minute or 10 minutes; if it is of the school of Abjuration, Divination, Enchantment, Illusion, or Transmutation, it can instead have a casting time of 1 action or bonus action. If the spell has a range of self, you can cast it on another creature or an object instead. For example, you could make {@spell Locate Object} permanent on a compass, or {@spell Comprehend Languages} permanent on an ally. Creatures which have 5th or higher level spell slots cannot be targeted by this spell due to interference from their own casting abilities.",
                "You cast that spell as part of casting this spell, but its effects do not immediately take hold. If you cast both spells this way every day for 10 days per level of the chosen spell, with the same target every time, the chosen spell becomes permanent on the target and does not require concentration. Cantrips require 5 days.",
                "You must expend appropriate spell slots and material components (if applicable) for each casting of the spells. If the chosen spell does not have consumed material components, it instead costs 1 gp per level of the chosen spell for each casting. Cantrips cost 5 sp per casting. It costs half as much for wizards of the same school as the spell they are making permanent.",
                "A permanent spell can be dispelled as though Permanence were the active spell, but an ability check is always required. All permanent spells on a target end immediately if the target ever gains 5th or higher level spell slots."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "When you cast this spell using a spell slot of 7th level or higher, the chosen spell can be one level higher for each slot level above 6th."
                    ]
                }
            ],
            "fluff": {
                "type": "entries",
                "entries": [
                    ""
                ]
            },
            "areaTags": [
                "ST"
            ],
            "miscTags": [
                "PRM"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "The Ole Switcheroo",
            "source": "FA:V",
            "level": 9,
            "school": "C",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "self"
                }
            },
            "components": {
                "v": true,
                "m": {
                    "text": "a small statuette of yourself worth 150 gp, which the spell consumes",
                    "cost": 15000,
                    "consume": "optional"
                }
            },
            "duration": [
                {
                    "type": "permanent",
                    "ends": [
                        "dispel"
                    ]
                }
            ],
            "entries": [
                "When you cast this spell for the first time, you conjure a duplicate of yourself which appears within 5 feet of you and retains all personality, memories, and statistics, but is formed without any equipment. It appears nonmagical to spells and magical effects, such as {@spell Detect Magic|PHB}. It can gain knowledge, but lacks the ability to meaningfully change. Thus, it can't gain levels or other abilities, nor can it ever react differently to a situation than you would have at the moment you conjured it if you had the knowledge it currently possesses. While your double exists, it can cast spells using your spell slots - it has no spell slots of its own.",
                "Either of you can cast the spell again to either create a new double, or to teleport the other (if willing) to an unoccupied space within 60 feet of the caster. The teleportation option does not require the spell's material component. Either way, when the spell is cast again by either of you while a double lives, you gain all the memories and knowledge your double possesses and can distinguish them from your own. The double's max HP then becomes 1 hit point, and it dies at the end of its next turn; this cannot be prevented by any means.",
                "The double's body vanishes completely when it dies, and it cannot be returned from death. The spell ends upon its death."
            ],
            "fluff": {
                "type": "entries",
                "entries": [
                    "This spell is the School of Conjuration's answer to {@spell Project Image}, {@spell Simulacrum}, and {@spell Clone}. The spell's creators had to make several concessions in its power to keep its material cost on par with that of the reference spells, one of which they later regretted. Regardless, the spell now exists for any who grow powerful enough to sieze it, though none have in a long time..."
                ]
            },
            "miscTags": [
                "PRM"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        }
    ],
    "class": [
    ],
    "classFeature": [
    ],
    "subclass": [
    ],
    "subclassFeature": [
    ],
    "variantrule": [
        {
            "name": "Martial Checks",
            "source": "FA:V",
            "entries": [
                "While in combat, you can use the {@action Search} action to make a special kind of ability check, a martial check. This check may be made using your choice of Intelligence ({@skill Investigation}) or Wisdom ({@skill Insight}). You most likely won't be able to make this check outside of combat, as it's hard to ascertain a creature's abilities without seeing it fight. However, exceptions in special circumstances may occasionally be made. The DC for martial checks is generally 10 plus half the CR of the target, and if your skill check beats the DC by 5 or more you also get one piece of insight into how the trait is used in the creature's strategy.",
                "With each martial check, you can ask for one of the following:",
                {
                    "type": "list",
                    "items": [
                        {
                            "entries": [
                                "Base AC (i.e. including armour/shield) and max HP."
                            ]
                        },
                        {
                            "entries": [
                                "Damage resistances, immunities, and vulnerabilities; and condition immunities."
                            ]
                        },
                        {
                            "entries": [
                                "Skill and saving throw proficiencies."
                            ]
                        },
                        {
                            "entries": [
                                "Senses and speeds - types, as well as relevant features like Keen Hearing or a bonus action Disengage or Dash."
                            ]
                        },
                        {
                            "entries": [
                                "Full information on a single action it can take."
                            ]
                        },
                        {
                            "entries": [
                                "Its full list of actions (but not any details on what the actions are)."
                            ]
                        }
                    ]
                },
                "You may make a general check instead of asking a specific question, which cumulatively reveal information as follows, representing any prior knowledge your character may be able to apply to or discern from the enemy:",
                {
                    "type": "list",
                    "items": [
                        {
                            "entries": [
                                "For every multiple of 5 on your result, you get the name and description of a single trait the creature possesses."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Multi-tiered Initiative",
            "source": "FA:V",
            "entries": [
                "While I understand the problem that legendary actions/resistances fix, I don't like some of the consequences of the legendary action/resistance route. I'll be heavily reducing/limiting their use. My solution comes mostly from multi-tiered initiative, with occasional use of effect management to add extra resilience.",
                "<b>Multi-tiered initiative</b> replaces legendary actions and partially replaces legendary resistances. It gives a monster multiple set initiative turns every round which are placed as far from each other as possible - this means the monster does not roll initiative. One of those turns (the \"Tier 1\" turn) is the \"normal\" combat turn, on which the monster can perform any basic action or attack or use a Tier 1 ability like Multiattack, and move up to its speed. On all its other turns in a round, the monster can only perform a basic attack or use abilities specific to that tier, and nothing else (including moving). Tiered monsters have an action and a bonus action available on each of their turns. They only have one reaction per round, which they regain at the start of their Tier 1 turn. Recharge abilities only get recharge rolls on their corresponding tier's turn. Each of a tiered monster's turns in a round count as independent turns for the purpose of all other effects and timings which occur at the start or end of their turn. Any creature traits apply to all turns unless specifically marked otherwise",
                "<b>Effect management</b> replaces legendary resistances, and comes in the form of abilities as diverse as the monsters that possess them. Generally, on its turn, a monster can perform an exchange (such as sacrificing HP or losing use of an ability or trait) to automatically remove an effect it's subjected to. The trade will always be in the monster's favour when the effect is completely locking it down or preventing it from participating in normal combat, but minor effects will generally not be worth the cost of such a trade-off. These sacrifices will generally still either require use of an action or bonus action or will occur at the end of a tiered turn, so incapacitation effects remain particularly detrimental to tiered monsters."
            ]
        },
        {
            "name": "Multi-tiered Initiative Turns",
            "source": "FA:V",
            "entries": [
                "These are the base values, with the monster taking its T1 turn at the highest value and its last tier's turn at the lowest value. The monster's Intelligence modifier is added to each of these, with its Dexterity score used as a tie-breaker.",
                "If I ever run an encounter with more than 6 tiers, each additional initiative is 5 higher (i.e. 30, 35, 40). It probably won't happen though.",
                {
                    "type": "table",
                    "caption": "Turns",
                    "colLabels": [
                        "Tier",
                        "Initiatives"
                    ],
                    "colStyles": [
                        "text-center",
                        "text-left"
                    ],
                    "rows": [
                        [
                            "2",
                            "15, 5"
                        ],
                        [
                            "3",
                            "18, 11, 4"
                        ],
                        [
                            "4",
                            "20, 15, 10, 5"
                        ],
                        [
                            "5",
                            "25, 20, 15, 10, 5"
                        ],
                        [
                            "6",
                            "25, 20, 15, 10, 5, 0"
                        ]
                    ]
                }
            ]
        }
    ]
}